# =============================================================================
# Brewfile — Homebrew 패키지 목록
# =============================================================================

# --- Shell ---
brew "zsh"
brew "sheldon"
brew "starship"

# --- 현대적 CLI ---
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "tree"
brew "wget"
brew "curl"
brew "htop"
brew "gh"
brew "fswatch"

# --- Git ---
brew "git"
brew "git-delta"
brew "lazygit"
brew "gitui"
brew "bfg"

# --- 에디터/LSP ---
brew "marksman"
brew "rust-analyzer"
brew "ast-grep"

# --- 런타임 & 빌드 ---
brew "mise"
brew "deno"
brew "oven-sh/bun/bun"
brew "go"
brew "rustup"
brew "uv"
brew "cmake"
brew "sccache"

# --- 컨테이너 ---
brew "docker"
brew "docker-compose"
brew "colima"
brew "container"

# --- AI/ML ---
brew "ollama"
brew "lume"

# --- 도구 ---
brew "code2prompt"
brew "rtk"
brew "beads"
brew "tmux"
brew "zellij"
brew "supervisor"
brew "ffmpeg"
brew "libpq"
brew "agent-browser"

# --- Cask: 터미널 ---
cask "ghostty"
cask "cmux"

# --- Cask: 개발 ---
cask "visual-studio-code"

# --- 폰트 ---
cask "font-meslo-for-powerlevel10k"
